<?php
/**
 * Плагін Attacher: український переклад
 *
 * @package Attacher
 * @author Roffun
 * @copyright Copyright (c) Roffun, Webitproff 2018 - 2025 | https://github.com/webitproff
 * @license BSD License
 */

defined('COT_CODE') or die('Wrong URL');

$L['info_name'] = 'Attacher';
$L['info_desc'] = 'Завантаження зображень і файлів. Прикріплення файлів, генерація різних розмірів та обробка "на льоту" зображень у статтях, вставка у візуальний редактор';

/**
 * КОНФІГУРАЦІЯ
 */
$L['cfg_folder'] = 'Директорія для файлів';
$L['cfg_prefix'] = 'Префікс імен файлів';
$L['cfg_exts'] = 'Дозволені типи файлів (через кому, без крапок і пробілів)';
$L['cfg_items'] = 'Макс. кількість вкладень у кожному повідомленні';
$L['cfg_accept'] = ['Допустимі MIME-типи у вікні вибору файлів, через кому.', 'Порожнє значення дозволяє всі типи. Можна використовувати спеціальні типи: image/*, audio/*, video/*'];
$L['cfg_filesize'] = 'Макс. розмір файлів у байтах';
$L['cfg_chunkSize'] = ['Завантажувати файли частинами по (байт)', 'Великі файли можна завантажувати невеликими частинами. Це дозволяє завантажувати файли більшого розміру, ніж зазначено в обмеженнях $_POST. (Залиште порожнім для відключення)'];
$L['cfg_filespace'] = 'Загальний дисковий простір для кожного користувача';
$L['cfg_autoupload'] = 'Починати завантаження автоматично';
$L['cfg_sequential'] = 'Послідовне завантаження замість паралельного';
$L['cfg_css'] = 'Підключення стилів';

/**
 * НАЛАШТУВАННЯ ЗАВАНТАЖЕННЯ ЗОБРАЖЕНЬ
 */
$L['cfg_sep_orig'] = 'НАЛАШТУВАННЯ ЗАВАНТАЖЕННЯ ЗОБРАЖЕНЬ';
$L['cfg_img_resize'] = ['Зменшувати завантажені зображення', 'Завантажені зображення будуть пропорційно зменшені відповідно до наступних параметрів'];
$L['cfg_img_maxwidht'] = 'Зменшувати ширину зображення до';
$L['cfg_img_maxheight'] = 'Зменшувати висоту зображення до';
$L['cfg_imageconvert'] = 'Конвертувати всі зображення в JPG під час завантаження';
$L['cfg_quality'] = 'Якість JPEG у %';

/**
 * НАЛАШТУВАННЯ СТВОРЕННЯ КОПІЙ (мініатюр)
 */
$L['cfg_sep_thumbs'] = 'НАЛАШТУВАННЯ СТВОРЕННЯ КОПІЙ (мініатюр)';
$L['cfg_thumbs'] = 'Показувати мініатюри зображень?';
$L['cfg_upscale'] = 'Збільшувати зображення, які менші за розміри мініатюри';
$L['cfg_thumb_x'] = 'Ширина мініатюри за замовчуванням';
$L['cfg_thumb_y'] = 'Висота мініатюри за замовчуванням';
$L['cfg_thumb_framing'] = 'Режим кадрування мініатюри за замовчуванням';
$L['cfg_thumb_framing_params'] = [
    'height' => 'За висотою',
    'width' => 'За шириною',
    'auto' => 'Авто',
    'crop' => 'Кадрувати'
];
$L['cfg_thumb_big_width'] = 'Ширина великої мініатюри';
$L['cfg_thumb_big_height'] = 'Висота великої мініатюри';
$L['cfg_thumb_big_framing'] = 'Режим обрізки великої мініатюри';

/**
 * ВОДЯНИЙ ЗНАК І ФОНОВА ТЕКСТУРА
 */
$L['cfg_sep_wmark_bg'] = 'ВОДЯНИЙ ЗНАК І ФОНОВА ТЕКСТУРА';
$L['cfg_thumb_watermark'] = ['Водяний знак для мініатюр', 'Шлях до файлу водяного знака. Підтримуються PNG з прозорістю. (Залиште порожнім, щоб відключити водяні знаки)'];
$L['cfg_thumb_wm_x'] = ['Водяний знак. Мін. ширина', 'Водяний знак буде застосовано до мініатюри, лише якщо її ширина більша за вказану'];
$L['cfg_thumb_wm_y'] = ['Водяний знак. Мін. висота', 'Водяний знак буде застосовано до мініатюри, лише якщо її висота більша за вказану'];
$L['cfg_bg_image'] = 'Шлях до файлу фонової текстури';
$L['cfg_bg_space'] = 'Розмір відступу для заповнення текстурою';
$L['cfg_bg_space_hint'] = '0 для відключення';

/**
 * ОБРОБКА "НА ЛЬОТУ" В СТАТТЯХ
 */
$L['cfg_sep_replacement'] = 'ОБРОБКА "НА ЛЬОТУ" В СТАТТЯХ';
$L['cfg_thumb_clickable'] = 'Як відображати зображення в статтях';
$L['cfg_thumb_clickable_params'] = ['За замовчуванням', 'Усі як посилання', 'Усі як зображення'];
$L['cfg_thumb_alt_to_title'] = ['Створити title для посилань із вмісту alt', '<i>працює лише при увімкненому режимі відображення посиланням</i>'];
$L['cfg_thumb_strip_style'] = 'Вирізати атрибут style у зображень';
$L['cfg_thumb_to_picture'] = 'Перетворити всі зображення в адаптивний PICTURE';
$L['cfg_thumb_wrapper'] = 'Створити контейнер (span)';
$L['cfg_thumb_wrapper_class'] = 'Імена класів для контейнера span';
$L['att_add_pict_files'] = 'Зображення та файли';
$L['att_add'] = 'Додати файли';
$L['att_attach'] = 'Прикріпити файли';
$L['att_attachment'] = 'Прикріплений файл';
$L['att_attachments'] = 'Вкладення';
$L['att_cancel'] = 'Скасувати завантаження';
$L['att_cleanup'] = 'Очищення';
$L['att_allthumbs_remove'] = 'Видалити всі мініатюри';
$L['att_cleanup_confirm'] = 'Це видалить усі файли, прикріплені до неіснуючих повідомлень. Продовжити?';
$L['att_allthumbs_remove_confirm'] = 'Це видалить усі створені мініатюри зображень, вони автоматично згенеруються з оригіналу під час звернення. Продовжити?';
$L['att_delete'] = 'Видалити';
$L['att_downloads'] = 'Завантаження';
$L['att_ensure'] = 'Ви впевнені?';
$L['att_free'] = 'вільно';
$L['att_filename'] = 'Ім\'я файлу';
$L['att_gallery'] = 'Галерея';
$L['att_processing'] = 'Обробка';
$L['att_info'] = 'Інформація';
$L['att_item'] = 'Елемент';
$L['att_items_removed'] = 'Елементів видалено';
$L['att_thumbs_removed'] = 'Мініатюри видалено';
$L['att_kb'] = 'КБ';
$L['att_kb_left_of'] = 'КБ залишилося, файли не більше';
$L['att_maxsize'] = 'макс. розмір файлу';
$L['att_of'] = 'з';
$L['att_remove_all'] = 'Видалити всі';
$L['att_replace'] = 'Замінити';
$L['att_show_info'] = 'Показати інформацію про елемент';
$L['att_size'] = 'Розмір';
$L['att_slideshow'] = 'Слайдшоу';
$L['att_start'] = 'Почати';
$L['att_start_upload'] = 'Почати завантаження';
$L['att_title'] = 'Назва';
$L['att_title_here'] = 'Вкажіть назву тут';
$L['att_total'] = 'всього';
$L['att_type'] = 'Тип';
$L['att_used'] = 'використано';
$L['att_user'] = 'Користувач';
$L['att_your_space'] = 'Ваш простір';
$L['att_drag_here'] = 'Перетягніть файли сюди';
$L['att_check'] = 'Позначити';
$L['att_check_all'] = 'Позначити всі';

// Помилки
$L['att_err_db'] = 'Помилка бази даних';
$L['att_err_delete'] = 'Неможливо видалити вкладення';
$L['att_err_move'] = 'Неможливо перемістити завантажений файл';
$L['att_err_noitems'] = 'Не знайдено жодного елемента';
$L['att_err_nospace'] = 'Недостатньо особистого дискового простору';
$L['att_err_perms'] = 'У вас недостатньо прав для цієї дії';
$L['att_err_replace'] = 'Неможливо замінити файл';
$L['att_err_thumb'] = 'Неможливо створити попередній перегляд зображення';
$L['att_err_title'] = 'Назва файлу залишилася порожньою';
$L['att_err_toobig'] = 'Файл занадто великий';
$L['att_err_type'] = 'Такий тип файлів не дозволено';
$L['att_err_upload'] = 'Не вдалося завантажити файл';
$L['att_err_count'] = 'Перевищено максимальну кількість файлів';

$L['att_button_small_title'] = (cot::$cfg['plugin']['attacher']['thumb_x'] ?? 100) . '*' . (cot::$cfg['plugin']['attacher']['thumb_y'] ?? 100);
$L['att_button_big_title'] = (cot::$cfg['plugin']['attacher']['thumb_big_width'] ?? 800) . '*' . (cot::$cfg['plugin']['attacher']['thumb_big_height'] ?? 600);
$L['visual_only'] = 'Вставка доступна у візуальному режимі, вийдіть із режиму коду!';

$L['att_url_placeholder'] = 'Введіть URL зображення';
$L['att_url_empty'] = 'Будь ласка, введіть URL зображення';
$L['att_upload_url'] = 'Завантажити за URL';
$L['att_url_error'] = 'Не вдалося завантажити зображення за URL';